Dlubal.RFEM5.IModelData2
Interface for working with model data.

Dlubal.RFEM5.IModelData2.GetLineSupport2(System.Int32,System.UInt32)
Gets interface for working with line support.
Returns: Line support interface.
No: No. or index of the line support you want to get.
At: Specifies the type of access.

Dlubal.RFEM5.IModelData2.SetLineSupport2(System.UInt32@)
Sets line support and returns it's interface.
Returns: Line support interface.
Support: Line support parameters.

Dlubal.RFEM5.IModelData2.GetLineSupports2
Gets array of line supports.
Returns: Array of line supports.

Dlubal.RFEM5.IModelData2.SetLineSupports2(System.UInt32@)
Sets array of line supports.
Supports: Array of line supports to be set.